In [2]:
df = read.table("Du_lieu/Table6.txt",
               skip=1,
               header =TRUE,
               flush=TRUE,
               comment.char="@",
               stringsAsFactor=FALSE)
print(head(df))

    Name Age Height Weight Sex
1   Alex  25    177     57   F
2  Lilly  31    163     69   F
3   Mark  23    190     83   M
4 Oliver  52    179     75   M
5 Martha  76    163     70   F
6  Lucas  49    183     83   M

In [3]:
print("before dropping:")
print(paste("Rows:", nrow(df)))

[1] "before dropping:"
[1] "Rows: 105"

In [4]:
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──
✔ ggplot2 3.3.0     ✔ purrr   0.3.4
✔ tibble  3.0.1     ✔ dplyr   0.8.5
✔ tidyr   1.0.2     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.5.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [5]:
df = df %>% unique()
print("after dropping:")
print(paste("Rows:", nrow(df)))

[1] "after dropping:"
[1] "Rows: 7"

In [6]:
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [7]:
rownames(df)= df$Name
df$Name = NULL
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [8]:
print("write to file")
write.table(df, file="Du_lieu/Table6_new.txt", sep="\t")

[1] "write to file"

In [9]:
df_new = read.table("Du_lieu/Table6_new.txt")
print(df_new)

         Age Height Weight Sex
Alex      25    177     57   F
Lilly     31    163     69   F
Mark      23    190     83   M
Oliver    52    179     75   M
Martha    76    163     70   F
Lucas     49    183     83   M
Caroline  26    164     53   F